In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Series

In [2]:
pd.Series()

Series([], dtype: object)

In [3]:
liste = [1,2,3,4,5]

In [4]:
seri = pd.Series(liste)
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.dtype

dtype('int64')

In [7]:
arr = np.array([1,2,5.6,'array'])
arr

array(['1', '2', '5.6', 'array'], dtype='<U32')

In [9]:
seri = pd.Series([1,2,5.6,'array'])
seri

0        1
1        2
2      5.6
3    array
dtype: object

In [10]:
seri.apply(type)

0      <class 'int'>
1      <class 'int'>
2    <class 'float'>
3      <class 'str'>
dtype: object

In [12]:
seri = pd.Series([1,2,3.7,8.9]).astype(int)
seri

0    1
1    2
2    3
3    8
dtype: int64

In [13]:
seri2 = pd.Series([1,2,3.7,8.9], dtype = 'int32')
seri2 # veri kaybı olacağı için hata verir

ValueError: Trying to coerce float values to integers

In [14]:
seri3 = pd.Series([1,2,3.7,8.9], dtype = str)
seri3

0      1
1      2
2    3.7
3    8.9
dtype: object

In [15]:
seri4 = pd.Series([1,2,3.7,8.9], dtype = float)
seri4

0    1.0
1    2.0
2    3.7
3    8.9
dtype: float64

In [16]:
seri4 = pd.Series([1,2,3.7,8.9])
seri4

0    1.0
1    2.0
2    3.7
3    8.9
dtype: float64

In [18]:
seri = pd.Series([1,2,3],dtype = int)
seri

0    1
1    2
2    3
dtype: int64

In [19]:
seri = pd.Series(data = liste,index = ['a','b','c','d','e'])
seri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [20]:
seri = pd.Series(data = liste,index = ['a','b','c','d','e','f'])
seri # verdiğimiz index sayisi daha fazla

ValueError: Length of values (5) does not match length of index (6)

# Numpy arrays

In [21]:
arr = np.arange(12).reshape(4,3)
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [22]:
seri = pd.Series(data = arr)
seri # array direk içine yazamayız

ValueError: Data must be 1-dimensional, got ndarray of shape (4, 3) instead

In [23]:
arr1 = np.arange(5)
arr1

array([0, 1, 2, 3, 4])

In [25]:
seri = pd.Series(arr1)
seri # 1. yöntem

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [26]:
seri = pd.Series(np.arange(5))
seri # 2. yöntem

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [27]:
seri = pd.Series(np.arange(10,50,10), index = [1,2,3,4])
seri

1    10
2    20
3    30
4    40
dtype: int64

In [28]:
seri = pd.Series(np.arange(10,50,10), index = np.arange(1,5))
seri

1    10
2    20
3    30
4    40
dtype: int64

In [29]:
seri = pd.Series(np.arange(10,50,10), index = ['1','2','3','4'])
seri # index i hem tuple hemde liste içinde yazabiliriz

1    10
2    20
3    30
4    40
dtype: int64

In [30]:
seri = pd.Series(np.arange(10,50,10), index = ('1','2','3','4'))
seri # index i hem tuple hemde liste içinde yazabiliriz

1    10
2    20
3    30
4    40
dtype: int64

In [31]:
seri = pd.Series(np.arange(10,50,10), index = (1,2,3,4))
seri

1    10
2    20
3    30
4    40
dtype: int64

# Numpy dict

In [32]:
dict = { 'resim' : 75, 'fen' : 90, 'mat' : 80}

In [33]:
seri = pd.Series(dict)
seri

resim    75
fen      90
mat      80
dtype: int64

In [36]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
dtype: float64

In [37]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','fen'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
fen      90.0
dtype: float64

In [38]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','tarih'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
tarih     NaN
dtype: float64

In [39]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','fen','resim'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
fen      90.0
resim    75.0
dtype: float64

In [ ]:
#scalar value

In [40]:
pd.Series([10])

0    10
dtype: int64

In [41]:
pd.Series(10, index = [1,2,3])

1    10
2    10
3    10
dtype: int64

In [43]:
pd.Series('pandas')

0    pandas
dtype: object

In [44]:
#Concat

In [45]:
dict

{'resim': 75, 'fen': 90, 'mat': 80}

In [46]:
seri = pd.Series(dict,index = ('x','fen','mat'))
seri

x       NaN
fen    90.0
mat    80.0
dtype: float64

In [47]:
seri2 = pd.concat((seri,seri)) # tuple olarak yazabiliriz
seri2

x       NaN
fen    90.0
mat    80.0
x       NaN
fen    90.0
mat    80.0
dtype: float64

In [48]:
seri2 = pd.concat([seri,seri]) # list olarak yazabiliriz
seri2

x       NaN
fen    90.0
mat    80.0
x       NaN
fen    90.0
mat    80.0
dtype: float64

In [49]:
x = pd.Series([356,357,358])
y = pd.Series(['ahmet','veli','mehmet','mustafa'])
pd.concat((x,y))

0        356
1        357
2        358
0      ahmet
1       veli
2     mehmet
3    mustafa
dtype: object

In [52]:
x = pd.Series([356,357,358])
y = pd.Series(['ahmet','veli','mehmet','mustafa'])
pd.concat((x,y),axis = 1)

       0        1
0  356.0    ahmet
1  357.0     veli
2  358.0   mehmet
3    NaN  mustafa

# indexing ve slicing with pandas serileri

In [53]:
seri = pd.Series([1,2,3,4],index = ["python","git","numpy","pandas"])
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [54]:
seri[3]

np.int64(4)

In [55]:
seri['pandas']

np.int64(4)

In [56]:
seri.index[3]

'pandas'

In [57]:
seri[2]

np.int64(3)

In [58]:
seri[2:]

numpy     3
pandas    4
dtype: int64

In [59]:
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [60]:
seri[1:3]

git      2
numpy    3
dtype: int64

In [62]:
seri[[0,3]] # birden fazla elemanı alırken parantez yazarız

python    1
pandas    4
dtype: int64

In [63]:
seri['git'] # tek parantez ile sadece value dönerken

np.int64(2)

In [64]:
seri[['git']] # tek parantez ile sadece value dönerken

git    2
dtype: int64

In [66]:
seri[['git','pandas']]

git       2
pandas    4
dtype: int64

In [68]:
seri['git':'pandas']
# index label ile slicing yaparken bitiş noktası olan index index label da dahil edilir

git       2
numpy     3
pandas    4
dtype: int64

In [69]:
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [70]:
seri[[0,3,2]]

python    1
pandas    4
numpy     3
dtype: int64

In [71]:
seri[::-1]

pandas    4
numpy     3
git       2
python    1
dtype: int64

# basic attributes ve methods of series

In [72]:
np.random.seed(42)
seri = pd.Series(np.random.randint(0,50,6))
seri

0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32

In [73]:
seri.dtype

dtype('int32')

In [74]:
seri.apply(type)

0    <class 'int'>
1    <class 'int'>
2    <class 'int'>
3    <class 'int'>
4    <class 'int'>
5    <class 'int'>
dtype: object

In [75]:
seri.size

6

In [76]:
seri.ndim

1

In [77]:
seri.index

RangeIndex(start=0, stop=6, step=1)

In [79]:
seri.values

array([38, 28, 14, 42,  7, 20], dtype=int32)

In [78]:
seri.items

<bound method Series.items of 0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32>

In [82]:
list(seri.items())

[(0, 38), (1, 28), (2, 14), (3, 42), (4, 7), (5, 20)]

In [83]:
seri.head() # default ilk 5 değeri döndürdü

0    38
1    28
2    14
3    42
4     7
dtype: int32

In [84]:
seri.head(2)

0    38
1    28
dtype: int32

In [85]:
seri.tail() # default son 5 değeri döndürdü

1    28
2    14
3    42
4     7
5    20
dtype: int32

In [86]:
seri.tail(2)

4     7
5    20
dtype: int32

In [87]:
seri.sample() # rastgele 1 değer döndürdü

5    20
dtype: int32

In [88]:
seri.sample(3)

0    38
1    28
2    14
dtype: int32

In [90]:
seri.sort_index(ascending = True) # default

0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32

In [91]:
seri.sort_index(ascending = False)

5    20
4     7
3    42
2    14
1    28
0    38
dtype: int32

In [92]:
seri.sort_values() #default ascending = True

4     7
2    14
5    20
1    28
0    38
3    42
dtype: int32

In [94]:
seri.sort_values(ascending = False)

3    42
0    38
1    28
5    20
2    14
4     7
dtype: int32

In [95]:
seri.sort_values(ascending = 0)

3    42
0    38
1    28
5    20
2    14
4     7
dtype: int32

In [96]:
seri.sort_values(ascending = 1)

4     7
2    14
5    20
1    28
0    38
3    42
dtype: int32

In [97]:
car_brands = ['Toyota', 'Ford', 'BMW', 'Mercedes', 'Audi', 'Tesla', 'Honda', 'Nissan', 'Chevrolet', 'Hyundai']
seri = pd.Series(car_brands)
seri

0       Toyota
1         Ford
2          BMW
3     Mercedes
4         Audi
5        Tesla
6        Honda
7       Nissan
8    Chevrolet
9      Hyundai
dtype: object

In [98]:
seri.isin(['Toyota','Ford']) # True ve False araması yaptık

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [100]:
seri[seri.isin(['Toyota','Ford'])]

0    Toyota
1      Ford
dtype: object

In [101]:
seri.isin([100,200])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [102]:
seri[seri.isin([100,200])]

Series([], dtype: object)

# DataFrames

In [2]:
data = [[1,2,3],[4,5,6]]
columns = ["A","B","C"]

df = pd.DataFrame(data = data)
df

   0  1  2
0  1  2  3
1  4  5  6

In [4]:
data = [[1,2,3],[4,5,6]]
columns = ["A","B","C"]

df = pd.DataFrame(data = data, columns = columns)
df

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

In [7]:
df.apply(type) # apply sütunların type bilgisini getirdi

A    <class 'pandas.core.series.Series'>
B    <class 'pandas.core.series.Series'>
C    <class 'pandas.core.series.Series'>
dtype: object

In [8]:
df.applymap(type) # applymap ise her bir hücre içindeki valuenun type bilgisini getirdi.

               A              B              C
0  <class 'int'>  <class 'int'>  <class 'int'>
1  <class 'int'>  <class 'int'>  <class 'int'>

# numpy array den data frame oluşturma

In [5]:
arr = np.arange(1,27,3).reshape(3,3)
arr

array([[ 1,  4,  7],
       [10, 13, 16],
       [19, 22, 25]])

In [6]:
df = pd.DataFrame(arr)
df

    0   1   2
0   1   4   7
1  10  13  16
2  19  22  25

In [7]:
df = pd.DataFrame(arr, columns = ['A1','A2','A3'])
df

   A1  A2  A3
0   1   4   7
1  10  13  16
2  19  22  25

In [8]:
df = pd.DataFrame(arr, columns = ['A1','A2','A3'], index = ['B1','B2','B3'])
df

    A1  A2  A3
B1   1   4   7
B2  10  13  16
B3  19  22  25

In [9]:
df = pd.DataFrame(arr,['A1','A2','A3'],['B1','B2','B3']) # columns ve index yazmazsak ilk satır sonra sütun indexi alır
df

    B1  B2  B3
A1   1   4   7
A2  10  13  16
A3  19  22  25

In [10]:
data = {'Name' : ['Zeliha','Mustafa','Ayşenur','Yasemin'], 'Age' : [25,33,28,33]}
df = pd.DataFrame(data)
df
# kayler : columns, value : value

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

# Basic Attributes & Methods of DataFrames

In [12]:
df

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [13]:
df.head() #default ilk 5 değer

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [14]:
df.head(2)

      Name  Age
0   Zeliha   25
1  Mustafa   33

In [15]:
df.tail() #defaultta son 5 değer

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [16]:
df.tail(2)

      Name  Age
2  Ayşenur   28
3  Yasemin   33

In [17]:
df.columns # sütun isimleri

Index(['Name', 'Age'], dtype='object')

In [18]:
df.columns[1] # 1. index sütun ismi

'Age'

In [20]:
df

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.Age

0    25
1    33
2    28
3    33
Name: Age, dtype: int64

In [23]:
df.Name

0     Zeliha
1    Mustafa
2    Ayşenur
3    Yasemin
Name: Name, dtype: object

In [24]:
df.mean() #string veriler ortalama alınmaz

TypeError: Could not convert ['ZelihaMustafaAyşenurYasemin'] to numeric

In [25]:
df.mean(numeric_only = True)

Age    29.75
dtype: float64

In [27]:
df.Age.mean()

np.float64(29.75)

In [28]:
df.Age.mode() # en çok tekrar eden değeri çıktı olarak verir

0    33
Name: Age, dtype: int64

In [29]:
df.std() # string değerlerin standart sapmasını hesaplayamaz

TypeError: could not convert string to float: 'Zeliha'

In [30]:
df.Age.std()

3.947573094109004

In [31]:
df.std(numeric_only = True)

Age    3.947573
dtype: float64

In [32]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [35]:
df.columns = ['İsim','Yas']
df

      İsim  Yas
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
df.index = ['a','b','c','d']
df

      İsim  Yas
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [38]:
df.rename(columns = {'İsim':'Name','Yas':'Age'}) # kalıcı bir değişiklik yapmaz

      Name  Age
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [39]:
df

      İsim  Yas
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [41]:
df.rename(columns = {'İsim':'Name','Yas':'Age'},inplace = True) # inplace ile kalıcı değişiklik yaptık 
df

      Name  Age
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [42]:
df.rename(index = {"a":1, "b":2, "c":3 ,"d":4})

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [43]:
df.rename(index = {"a":1, "b":2, "c":3 ,"d":4}, inplace = True)
# inplace ile kalıcı değişiklik yaptık
df

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [44]:
df.rename(index = {1:'bir',2:'iki',3:'üc',4:'dört'}, columns = {"Name" :"isim", "Age": "yaş"})

         isim  yaş
bir    Zeliha   25
iki   Mustafa   33
üc    Ayşenur   28
dört  Yasemin   33

In [45]:
df.shape

(4, 2)

In [48]:
df.shape[0] # sadece satır sayısını alır

4

In [49]:
df.shape[1] # sadece sütun sayısını alır

2

In [50]:
df.ndim # boyut bilgisi verir

2

In [51]:
df.size # eleman sayısını/value/eleman/entry verir

8

In [52]:
df

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [54]:
'Name' in df # df içinde name varmı? colums ve index label üzerinde arama yapıyor

True

In [53]:
25 in  df

False

In [55]:
'x' in df

False

In [56]:
df.Name == 'Zeliha'

1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [57]:
df[df.Name == 'Zeliha']

     Name  Age
1  Zeliha   25

In [58]:
df[df.Age == 25]

     Name  Age
1  Zeliha   25

In [59]:
df[df.Age == 33]

      Name  Age
2  Mustafa   33
4  Yasemin   33

# Indexing, Slicing & Selection

In [61]:
data={"isim":["Cem", "Ali", "Ayşe", "Fatma", "Veli","Seda", "Fatih"], "boy-m":[1.78, 1.70,1.60,1.70,1.80,1.65,1.85], "kilo-kg":[75,70, 55, 60, 80,72,83], "yas" : [18,45,25,30,29,35,50]}

In [62]:
df = pd.DataFrame(data,index = ['A','B','C','D','E','F','G'])
df

    isim  boy-m  kilo-kg  yas
A    Cem   1.78       75   18
B    Ali   1.70       70   45
C   Ayşe   1.60       55   25
D  Fatma   1.70       60   30
E   Veli   1.80       80   29
F   Seda   1.65       72   35
G  Fatih   1.85       83   50

In [64]:
df.isim

A      Cem
B      Ali
C     Ayşe
D    Fatma
E     Veli
F     Seda
G    Fatih
Name: isim, dtype: object

In [65]:
df['isim']

A      Cem
B      Ali
C     Ayşe
D    Fatma
E     Veli
F     Seda
G    Fatih
Name: isim, dtype: object

In [66]:
df.kilo-kg # kilo_kg olsaydı kabul ederdi

AttributeError: 'DataFrame' object has no attribute 'kilo'

In [67]:
df.boy-m # boy_m

AttributeError: 'DataFrame' object has no attribute 'boy'

In [68]:
df['kilo-kg']

A    75
B    70
C    55
D    60
E    80
F    72
G    83
Name: kilo-kg, dtype: int64

In [70]:
df['boy-m']

A    1.78
B    1.70
C    1.60
D    1.70
E    1.80
F    1.65
G    1.85
Name: boy-m, dtype: float64

In [69]:
df[['kilo-kg']] #data frame yapısı içinde geldi

   kilo-kg
A       75
B       70
C       55
D       60
E       80
F       72
G       83

In [71]:
df[['kilo-kg','boy-m']] # bişrden fazla sütunu çağırırken sütun Label larını liste içerisinde verdik

   kilo-kg  boy-m
A       75   1.78
B       70   1.70
C       55   1.60
D       60   1.70
E       80   1.80
F       72   1.65
G       83   1.85

In [72]:
# slicing
df[0:2] # 2 dahil değil 0. ve 1. indexli satırları getirdi

  isim  boy-m  kilo-kg  yas
A  Cem   1.78       75   18
B  Ali   1.70       70   45

In [73]:
# index label ile slicing
df['A':'C'] 
# index label kullandığımızda stop noktası dahil oldu. A,B ve C labellı satırlar geldi

   isim  boy-m  kilo-kg  yas
A   Cem   1.78       75   18
B   Ali   1.70       70   45
C  Ayşe   1.60       55   25

In [74]:
df['isim']['B']

'Ali'

In [75]:
df['isim'][1]

'Ali'

In [76]:
df['B']['isim'] #önce sütun girmek lazım

KeyError: 'B'

In [77]:
df['A':'C']

   isim  boy-m  kilo-kg  yas
A   Cem   1.78       75   18
B   Ali   1.70       70   45
C  Ayşe   1.60       55   25

In [78]:
df['A':'C']['isim']

A     Cem
B     Ali
C    Ayşe
Name: isim, dtype: object

In [79]:
df['A':'C'][['isim','yas']] 
# dataframe lerde ikiden fazla sütuna erişmek için liste içerisinde vermemiz gerekiyor

   isim  yas
A   Cem   18
B   Ali   45
C  Ayşe   25

In [82]:
df[['isim','yas']]['A':'C']

   isim  yas
A   Cem   18
B   Ali   45
C  Ayşe   25

In [80]:
df[['isim','yas']]

    isim  yas
A    Cem   18
B    Ali   45
C   Ayşe   25
D  Fatma   30
E   Veli   29
F   Seda   35
G  Fatih   50

# Creating a New Column

In [84]:
# df['yeni_sütun_ismi'] = ...........
df['BMI'] = df['kilo-kg']/(df['boy-m']**2)
df

    isim  boy-m  kilo-kg  yas        BMI
A    Cem   1.78       75   18  23.671254
B    Ali   1.70       70   45  24.221453
C   Ayşe   1.60       55   25  21.484375
D  Fatma   1.70       60   30  20.761246
E   Veli   1.80       80   29  24.691358
F   Seda   1.65       72   35  26.446281
G  Fatih   1.85       83   50  24.251278

In [86]:
# df['yeni_sütun_ismi'] = ...........
df['BMI'] = round(df['kilo-kg']/(df['boy-m']**2)) # yuvarlama
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [87]:
df['new'] = np.arange(1,8)
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

#  Removing Columns & Rows

In [89]:
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [90]:
df.drop('new')
# defaultta axis = 0 = satır olarak çalıştığı için new ismini index label da bulamadı hata verdi

KeyError: "['new'] not found in axis"

In [93]:
df.drop('new',axis = 1) # kalıcı değişiklik yapmadı

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [94]:
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [95]:
df.drop('new',axis = 'columns')

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [96]:
df.drop('new', axis = 1, inplace = True)
df
# yukarıda kalıcı bir değişiklik ile new sütunu silindiği için tekrar çalıştırırsak hata alır

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [97]:
df

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [98]:
df.drop(["kilo-kg", "boy-m"], axis = 1) # defaultta inplace = False olduğu için kalıcı değişiklik yapmaz

    isim  yas   BMI
A    Cem   18  24.0
B    Ali   45  24.0
C   Ayşe   25  21.0
D  Fatma   30  21.0
E   Veli   29  25.0
F   Seda   35  26.0
G  Fatih   50  24.0

In [99]:
df.drop(['A','B']) # defaultta axis = 0= satır olduğu için kalıcı değişiklik olmadı

    isim  boy-m  kilo-kg  yas   BMI
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [100]:
df.drop(['A','B'],axis = 0)

    isim  boy-m  kilo-kg  yas   BMI
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

# Selecting Rows and Columns using .loc[ ] and iloc[ ]

- NOT!!!!!!!!!
- loc[satir label,sutun label,step]
- iloc[satir indexi, sutun indexi, step]

In [102]:
data = np.arange(20).reshape(5,4)
df = pd.DataFrame(data, columns = ['col1','col2','col3','col4'],index = range(1,6))
df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [103]:
df.loc[3] # 3 değerli satırdaki value/entry/değerleri getirdi

col1     8
col2     9
col3    10
col4    11
Name: 3, dtype: int64

In [104]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [105]:
df.index = ['a','b','c','d','e']
df
# index label ları değiştirdik

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [106]:
df.loc['b':'e']

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [107]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [108]:
df.iloc[2:5] # iloc klasik defaultta çalışan index numaraları üzerinden çalışır. 0. 1. 2. gibi

   col1  col2  col3  col4
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [109]:
df.loc['b','col2']

np.int64(5)

In [110]:
df.loc['b']

col1    4
col2    5
col3    6
col4    7
Name: b, dtype: int64

In [111]:
df.loc['b']['col2']

np.int64(5)

In [112]:
df.loc[['b'],['col2']]

   col2
b     5

In [113]:
df.iloc[1,1] # iloc[satır index,sütun index]

np.int64(5)

In [114]:
df.iloc[[1,1,2]] # liste içerisinde satır index numaraları verdiğimizde her birisini birer satır olarak çağırır

   col1  col2  col3  col4
b     4     5     6     7
b     4     5     6     7
c     8     9    10    11

In [115]:
df.iloc[[1],[1]]

   col2
b     5

In [116]:
df.loc['b':'d',['col3','col4']] # b satırından başlayıp d satırınıa kadar col3 ve col4 kolonunu getir dedik

   col3  col4
b     6     7
c    10    11
d    14    15

In [117]:
df.loc['b':'d','col1':'col4'] # satır ve sütun slicing ile çıktı aldık

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [118]:
df.loc[['d','b','c']] # liste ile istediğimiz satır labellarını istediğimiz sırada yazdırdık

   col1  col2  col3  col4
d    12    13    14    15
b     4     5     6     7
c     8     9    10    11

In [119]:
df.loc[['d','b','c']][['col3','col1']] # liste ile istediğimiz satır ve sütun labellarını istediğimiz sırada yazdırdık

   col3  col1
d    14    12
b     6     4
c    10     8

In [120]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [121]:
df.iloc[1:4,0] # 1. satır indexsinden 4. satır indexsine kadar (dahil değil), 0. sütun indexsinin kesişimi

b     4
c     8
d    12
Name: col1, dtype: int64

In [122]:
df.iloc[1:4,[0]] # dataframe yapısı

   col1
b     4
c     8
d    12

In [123]:
df.iloc[1:4,[3]]

   col4
b     7
c    11
d    15

In [124]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [125]:
df.iloc[1:4]['col4'] # iloctan bağımsız kolan çağrılabilir.
# sütun labelını iloc içerisinden bağımısz oluşan dataframeden çağırdığımız için hata almadan çağırdı

b     7
c    11
d    15
Name: col4, dtype: int64

In [126]:
df.iloc[1:4,'col4'] # iloc label based çalıştığı için içerisinde sütun label yüzünden hata verdi

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [127]:
df.loc[:,['col3','col2']]

   col3  col2
a     2     1
b     6     5
c    10     9
d    14    13
e    18    17

In [128]:
df.iloc[:,[2,1]]

   col3  col2
a     2     1
b     6     5
c    10     9
d    14    13
e    18    17

In [129]:
df.loc[['d','e','a']][['col3','col1']]

   col3  col1
d    14    12
e    18    16
a     2     0

In [130]:
df.loc[['col3','col1']][['d','e','a']] # önce satır sonra sütunu aradığı için hata aldık

KeyError: "None of [Index(['col3', 'col1'], dtype='object')] are in the [index]"

In [131]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [132]:
df.loc[:,'col1':'col4':2] # .loc[bütün satırlar,start label:stop label:step

   col1  col3
a     0     2
b     4     6
c     8    10
d    12    14
e    16    18

In [133]:
df.iloc[:,::2] # iloc[tüm satırlar,başlangıç indexsi : bitiş indexsi : step]

   col1  col3
a     0     2
b     4     6
c     8    10
d    12    14
e    16    18

#  Conditional Selection

In [135]:
# koşul seçerek/ koşula uygun ifadelerin dönmesini sağlayarak seçim yapmak

In [136]:
df = pd.DataFrame(np.random.randn(5,4) , index = 'a b c d e'.split() , columns = ['A','B','C','D'])
df

          A         B         C         D
a  1.789879  1.562768  1.772806 -0.935585
b  0.251713 -0.408699 -0.019895 -0.659717
c -2.153428  0.785733 -0.451706 -1.643336
d  0.617855 -0.073256 -0.989565 -1.344044
e -0.170141 -0.960851 -0.154375 -1.173983

In [137]:
df > 0 # 0 dan büyük olanlar için True döndü

       A      B      C      D
a   True   True   True  False
b   True  False  False  False
c  False   True  False  False
d   True  False  False  False
e  False  False  False  False

In [138]:
df[df > 0]
# koşula uygun olan değerler dataframe üzerinde yazarken False olan koşula uymayan değerler NaN olarak yazıldı

          A         B         C   D
a  1.789879  1.562768  1.772806 NaN
b  0.251713       NaN       NaN NaN
c       NaN  0.785733       NaN NaN
d  0.617855       NaN       NaN NaN
e       NaN       NaN       NaN NaN

In [139]:
df['A'] < 0

a    False
b    False
c     True
d    False
e     True
Name: A, dtype: bool

In [140]:
df[df['A'] < 0]

          A         B         C         D
c -2.153428  0.785733 -0.451706 -1.643336
e -0.170141 -0.960851 -0.154375 -1.173983

In [141]:
df[df['A'] < 0][['A']]

          A
c -2.153428
e -0.170141

In [142]:
df[df['A'] < 0][['B']]  # 0 dan küçük değerlere sahip A sütunu değerlerinin olduğu satırlardaki B sütunu değerlerini çağırdık

          B
c  0.785733
e -0.960851

In [143]:
df

          A         B         C         D
a  1.789879  1.562768  1.772806 -0.935585
b  0.251713 -0.408699 -0.019895 -0.659717
c -2.153428  0.785733 -0.451706 -1.643336
d  0.617855 -0.073256 -0.989565 -1.344044
e -0.170141 -0.960851 -0.154375 -1.173983

In [144]:
df.loc[df['A'] < 0]

          A         B         C         D
c -2.153428  0.785733 -0.451706 -1.643336
e -0.170141 -0.960851 -0.154375 -1.173983

# reset_index() & set_index()

In [3]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(5,4), index = "a b c d e".split(), columns = ["A","B","C","D"])
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [4]:
df.reset_index() 
# kalıcı değişiklik yapmaz
# label indexleri resetledi default 0,1,... haline getirdi, eski label indexleri sütun haline getirdi

  index         A         B         C         D
0     a  0.496714 -0.138264  0.647689  1.523030
1     b -0.234153 -0.234137  1.579213  0.767435
2     c -0.469474  0.542560 -0.463418 -0.465730
3     d  0.241962 -1.913280 -1.724918 -0.562288
4     e -1.012831  0.314247 -0.908024 -1.412304

In [5]:
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [6]:
df.reset_index(drop = True) # drop  = True parametresi ile eski index labelları düşürdük

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [7]:
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [8]:
df.reset_index(drop = True, inplace = True)
df
# inplace = True ile kalıcı değişiklik yapıldı

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [9]:
df

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [10]:
df.set_index('C') # C sütununu index label haline getirdi ve sütunlar içerisinden düşürdü
# kalıcı bir değişiklik olmadı

                  A         B         D
C
 0.647689  0.496714 -0.138264  1.523030
 1.579213 -0.234153 -0.234137  0.767435
-0.463418 -0.469474  0.542560 -0.465730
-1.724918  0.241962 -1.913280 -0.562288
-0.908024 -1.012831  0.314247 -1.412304

In [11]:
df

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [12]:
df.set_index('C', drop = False) # drop = False ile C sütunu düşürmeden ayrıca index label haline gelmiş oldu

                  A         B         C         D
C
 0.647689  0.496714 -0.138264  0.647689  1.523030
 1.579213 -0.234153 -0.234137  1.579213  0.767435
-0.463418 -0.469474  0.542560 -0.463418 -0.465730
-1.724918  0.241962 -1.913280 -1.724918 -0.562288
-0.908024 -1.012831  0.314247 -0.908024 -1.412304

In [13]:
df.set_index('C', drop = False, inplace = True)
# kalıcı değişiklik yaptık
df

                  A         B         C         D
C
 0.647689  0.496714 -0.138264  0.647689  1.523030
 1.579213 -0.234153 -0.234137  1.579213  0.767435
-0.463418 -0.469474  0.542560 -0.463418 -0.465730
-1.724918  0.241962 -1.913280 -1.724918 -0.562288
-0.908024 -1.012831  0.314247 -0.908024 -1.412304

# Some Useful Methods with Titanic Dataset

In [14]:
import seaborn as sns

In [15]:
sns.__version__

'0.13.2'

In [16]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [17]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [18]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [20]:
df.sample(3) # rastgele 3 satır getir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
321,0,3,male,27.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
70,0,2,male,32.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
209,1,1,male,40.0,0,0,31.0000,C,First,man,True,A,Cherbourg,yes,True

In [21]:
df.shape

(891, 15)

In [22]:
df.info() # data setinin genel değerlendirmesi var

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [23]:
df.info # tek tek sütun üzerinde inceleme yapar

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [24]:
df.describe() # çeşitli istatistiki bilgileri bize çıktı olarak verdi
# describe'ta int ve float olan 6 sütun geldi

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
df.describe().T # transpoze aldık

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [26]:
df.describe(include = 'number') # defaultta include = number olarak çalışır

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [27]:
df.describe(include = 'all') # tüm data type sütunları getirdi

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
df.describe(include = 'all') # tüm data type sütunları getirdi

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
df.describe(include = 'category').T

      count unique    top freq
class   891      3  Third  491
deck    203      7      C   59

In [30]:
df.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
248,1,1,male,37.0,1,1,52.5542,S,First,man,True,D,Southampton,yes,False
337,1,1,female,41.0,0,0,134.5000,C,First,woman,False,E,Cherbourg,yes,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True

In [31]:
df.describe(include = 'bool').T

           count unique   top freq
adult_male   891      2  True  537
alone        891      2  True  537

In [32]:
df.describe(exclude = 'number').T # number olmayanları getircek

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
class         891      3        Third  491
who           891      3          man  537
adult_male    891      2         True  537
deck          203      7            C   59
embark_town   889      3  Southampton  644
alive         891      2           no  549
alone         891      2         True  537

In [33]:
df.corr() # string değerlerden dolayı hata

ValueError: could not convert string to float: 'male'

In [34]:
df.corr(numeric_only = True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [35]:
df.survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [36]:
df.survived.value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [37]:
df.deck.value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [38]:
df.survived.value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [39]:
df.survived.value_counts(normalize = True) # normalize = True ile yüzeysel dağılımı çıktı verdi

survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [40]:
# df['sütun_adı'].unique()
df.embark_town.unique() # sütun içerisindeki benzersiz değerleri yazdırır

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [41]:
df.embark_town.nunique() # sütun içindeki kaç adet benzersiz değer olduğu bilgisini getirir

3

In [42]:
# df.sort_values(by = 'sütun ismi',ascending = True) # defaultta ascending True(küçükten büyüğe) sıralama yapar
df.sort_values(by = 'age',ascending = False) 
# ascending = False ile azalan sırada(büyükten küçüğe doğru) by parametresi ile verdiğimiz sütunu sıraladı

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [43]:
df.age.sort_values(ascending = False)

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [44]:
df['pclass'] == 1 # bileti 1. sınıf olanları döndür

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: pclass, Length: 891, dtype: bool

In [45]:
df[df['pclass'] == 1] # bileti 1. sınıf olan kişilerin bilgisini çektik

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [46]:
first_class = df[df['pclass'] == 1]
first_class.sample(5) # hayatta kalanlardan rastgele 5 kişi seçtik

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
256,1,1,female,NaN,0,0,79.2000,C,First,woman,False,NaN,Cherbourg,yes,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True
155,0,1,male,51.0,0,1,61.3792,C,First,man,True,NaN,Cherbourg,no,False

In [47]:
survival_rates = df.groupby('pclass')['survived'].mean()
survival_rates # sınıflara göre hayatta kalanların yüzdesini aldık

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [48]:
survival_rates = df.groupby('pclass')['survived'].mean()*100
survival_rates # sınıflara göre hayatta kalanların yüzdesini aldık

pclass
1    62.962963
2    47.282609
3    24.236253
Name: survived, dtype: float64

# Groupby & Aggregation Methods (aggregate() & agg())

groupby(); bir veri setindeki belirli bir sütuna göre gruplama yapmak için kullanılır.

Bu işlev, verileri gruplara ayırmak ve bu gruplar üzerinde çeşitli işlemler yapmak için kullanılır.

Örneğin, bir veri kümesinde müşterilerin isimleri, yaşları ve satın aldıkları ürünler yer alıyor olabilir. groupby() işlevi kullanarak, müşterilerin satın aldıkları ürüne göre gruplandırabilir ve her ürün için ortalama yaşlarını bulabilirsiniz.

Source01, Source02, Source03 Pandas'ın aggregation yöntemleri, belirli bir veri kümesi üzerinde işlemler gerçekleştirerek bir sonuç döndürür.

Bu yöntemler, bir veri kümesindeki değerleri toplama, ortalama alma, en büyük veya en küçük değeri bulma gibi farklı işlemleri gerçekleştirir.

Pandas'ın aggregation yöntemlerinden bazıları şunlardır:

sum(): Belirtilen sütunda yer alan tüm değerlerin toplamını döndürür.

mean(): Belirtilen sütunda yer alan tüm değerlerin ortalamasını döndürür.

median(): Gruplanmış verilerin medyanını hesaplar.

mode() Belirtilen sütunda en çok tekrar eden değerleri döndürür.

max(): Belirtilen sütunda yer alan en büyük değeri döndürür.

min(): Belirtilen sütunda yer alan en küçük değeri döndürür.

count(): Belirtilen sütunda yer alan toplam değer sayısını döndürür.

std(): Belirtilen sütunda yer alan değerlerin standart sapmasını döndürür.

var(): Belirtilen sütunda yer alan değerlerin varyansını döndürür.

describe(): Gruplanmış verilerin istatistiksel özetini hesaplar.

idxmin(): Belirtilen eksen boyunca minimum değeri içeren ilk indeksi döndürür.

idxmax(): Belirtilen eksen boyunca maksimum değeri içeren ilk indeksi döndürür.

corr(): Sütunlar arasındaki korelasyonu, NA/null değerleri hariç tutarak hesaplar.

Bu yöntemler, bir DataFrame veya Series üzerinde kullanılabilir ve istenilen sütun veya satırlarda işlem yapılabilir.

Pandas'ın aggregation yöntemleri, verileri hızlı ve etkili bir şekilde analiz etmek için çok kullanışlıdır.

In [49]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Hatice', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Salary':[180, 160, 150, 180, 240, 200, 220, 160],
        'Experience':[1,3,2,4,8,6,3,1]}

In [50]:
df = pd.DataFrame(data)
df

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3
7  OpenAI         IT    Elif   28     160           1

## Agg

In [51]:
df.agg([sum,min])

,Company,Department,Person,Age,Salary,Experience
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetHaticeFatmaMehmetZeynepAliYusufElif,254,1490,28
min,Amazon,HR,Ahmet,25,150,1

In [52]:
df.agg({'Age' : sum, 'Salary' : min})

Age       254
Salary    150
dtype: int64

In [53]:
df.agg({'Age' : max, 'Salary' : min})

Age        40
Salary    150
dtype: int64

In [54]:
df.agg({'Age' : [max,min], 'Salary' : [min,np.mean]})

       Age  Salary
max   40.0     NaN
min   25.0  150.00
mean   NaN  186.25

In [55]:
df.agg({'Age' : lambda x: x.max() - x.min()})

Age    15
dtype: int64

In [56]:
df.agg({"Department":["nunique","unique","count",]})

        Department
nunique          2
unique    [IT, HR]
count            8

## Groupby